Autodesk.Revit.DB.Structure.RebarHostData.GetRebarContainersInHost
Returns all RebarContainer elements hosted by the referenced element.
Since:
2016

Autodesk.Revit.DB.Structure.RebarHostData.GetFabricAreasInHost
Returns all FabricArea elements hosted by the referenced element.
Since:
2013

Autodesk.Revit.DB.Structure.RebarHostData.GetFabricSheetsInHost
Returns all FabricSheet elements hosted by the referenced element.
Since:
2015

Autodesk.Revit.DB.Structure.RebarHostData.GetPathReinforcementsInHost
Returns all PathReinforcement elements hosted by the referenced element.
Since:
2012

Autodesk.Revit.DB.Structure.RebarHostData.GetAreaReinforcementsInHost
Returns all AreaReinforcement elements hosted by the referenced element.
Since:
2012

Autodesk.Revit.DB.Structure.RebarHostData.GetRebarsInHost
Returns all Rebar elements hosted by the referenced element.
Since:
2012

Autodesk.Revit.DB.Structure.RebarHostData.SetCommonCoverType(Autodesk.Revit.DB.Structure.RebarCoverType)
Associate a single CoverType with all exposed faces of the host element.
coverType:
A CoverType object to be applied to all faces.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Structure.RebarHostData.GetCommonCoverType
If all exposed faces of the host have the same associated CoverType,
return that CoverType; otherwise, return null.
Returns:
The common CoverType for all exposed faces, or null
if there are multiple CoverTypes.
Since:
2012

Autodesk.Revit.DB.Structure.RebarHostData.SetCoverType(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Structure.RebarCoverType)
Associates the specified CoverType with the specified face of the element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
In this element, face does not have an associated CoverType, because
it is not exposed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.RebarHostData.GetCoverType(Autodesk.Revit.DB.Reference)
Gets the CoverType associated with a face of the element.
Returns:
The cover associated with the face, if it is an exposed face.
If the face is concealed, returns null.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.RebarHostData.IsFaceExposed(Autodesk.Revit.DB.Reference)
Checks whether the specified face is considered exposed, and
therefore has an associated CoverType.
Remarks:
This method replaces the method HasCoverTypeForReference() from
the 2011 Revit API.
Returns:
True if %face% is exposed, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Structure.RebarHostData.IsReferenceContainedByAValidHost(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)
Identifies whether an element that contains the given reference can host reinforcement.
Remarks:
Many different elements are allowed to host reinforcement,
for example, beams, walls, columns, or parts.
Often there are specific restrictions about whether an element
can host rebar beyond its type or category.
For example, the material type of the element may determine this.
Or for parts, the part must have been created from layers
that have their role set to Structure.
doc:
A document.
reference:
The reference that is part of the element that will be checked.
Returns:
True if the input Element can host reinforcement elements,
false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Structure.RebarHostData.IsValidHost(Autodesk.Revit.DB.Element)
Identifies whether a given element can host reinforcement.
Remarks:
Many different elements are allowed to host reinforcement,
for example, beams, walls, columns, or parts.
Often there are specific restrictions about whether an element
can host rebar beyond its type or category.
For example, the material type of the element may determine this.
Or for parts, the part must have been created from layers
that have their role set to Structure.
element:
The element to check.
Returns:
True if the input Element can host reinforcement elements,
false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Structure.RebarHostData.IsValidHost
Reports whether the element is a valid rebar host.
Remarks:
If GetRebarHostData() returns a RebarHostData object,
but RebarHostData.IsValidHost() returns false, this means
that the element can be made
a valid rebar host, generally by setting a property
like FLOOR_PARAM_IS_STRUCTURAL or by changing the
element's physical material to concrete. On the other
hand, if GetRebarHostData() returns null, the element
cannot be made into a rebar host.
Returns:
True if the referenced Element can currently host Rebar elements,
false otherwise.
Since:
2012

Autodesk.Revit.DB.Structure.RebarHostData.GetRebarHostData(Autodesk.Revit.DB.Element)
Gets a RebarHostData object referring to the specified
rebar host element.
Remarks:
Returns null for elements that cannot ever be rebar hosts,
such as levels.
host:
An element to host rebar.
Returns:
A RebarHostData object, or null.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null